Информационная_база/src/InformationRegisters/ОчередьРассылок/ОчередьРассылок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьРассылок</name>
  <resources>
    <name>СпособОтправки</name>
    <type>
      <types>EnumRef.ВидыКаналовСвязи</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияОтправкиРассылки</types>
    </type>
  </resources>
  <resources>
    <name>Событие</name>
    <type>
      <types>DocumentRef.Событие</types>
    </type>
  </resources>
  <resources>
    <name>ИнтервалМеждуПопытками</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПопытокОсталось</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СледующаяПопытка</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СообщениеОбОшибке</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторСообщенияSMS</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеСообщенияSMS</name>
    <type>
      <types>EnumRef.СостоянияСообщенияSMS</types>
    </type>
  </resources>
  <resources>
    <name>ВременнаяОтметка</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторыJSON</name>
    <comment>Идентификаторы сообщения на почтовом сервере</comment>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>МассоваяРассылка</name>
    <type>
      <types>DocumentRef.МассоваяРассылка</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КакСвязаться</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Информационная_база/src/InformationRegisters/ОчередьРассылок/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтобразитьСостояниеЗаданияВЗаголовкеФормы();
	
	ВизуализироватьОтборПоМассовойРассылке(Параметры);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.Событие
		И ЗначениеЗаполнено(Элемент.ТекущиеДанные.Событие) Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьЗначение(, Элемент.ТекущиеДанные.Событие);
		Возврат;
	КонецЕсли;
	
	Если Поле = Элементы.МассоваяРассылка
		И ЗначениеЗаполнено(Элемент.ТекущиеДанные.МассоваяРассылка) Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьЗначение(, Элемент.ТекущиеДанные.МассоваяРассылка);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьМассовуюРассылку(Команда)
	ПоказатьЗначение(, МассоваяРассылка);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтобразитьСостояниеЗаданияВЗаголовкеФормы()
	
	Если Не РегистрыСведений.ОчередьРассылок.ЗаданиеЗапланировано() Тогда
		Заголовок = НСтр("ru = 'Задание не запланировано'");
		Возврат;
	КонецЕсли;
	
	Если РегистрыСведений.ОчередьРассылок.ЗаданиеУжеВыполняется() Тогда
		Заголовок = НСтр("ru = 'Задание выполняется'");
		Возврат;
	КонецЕсли;
	
	Заголовок = НСтр("ru = 'Задание запланировано'");
	
КонецПроцедуры

&НаСервере
Процедура ВизуализироватьОтборПоМассовойРассылке(Параметры)
	
	Если Не Параметры.Свойство("Отбор") Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Параметры.Отбор) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Параметры.Отбор.Свойство("МассоваяРассылка") Тогда
		Возврат;
	КонецЕсли;
	
	МассоваяРассылка = Параметры.Отбор.МассоваяРассылка;
	Элементы.МассоваяРассылка.Видимость = Ложь;
	Элементы.ОткрытьМассовуюРассылку.Видимость = Истина;
	Элементы.ОткрытьМассовуюРассылку.Заголовок = МассоваяРассылка;
	
КонецПроцедуры

#КонецОбласти
